f = open('output.txt','w')
name =('Иванов','Сидоров','Петров','Дмитриев','Ефимов')
country =('Клянцов','Новозыбкова','Жуковки','Трубчевска','Дятькова')
for n in name:
    for c in country:
        if((((n == 'Иванов') and (c == 'Клянцов')) or ((n == 'Дмитриев') and (c == 'Новозыбкова')) and
        ((n == 'Сидоров') and (c == 'Клянцов')) or ((n == 'Петров') and (c == 'Трубчевска')) and    
        ((n == 'Петров') and (c == 'Клянцов')) or ((n == 'Дмитриев') and (c == 'Дятькова')) and
        ((n == 'Дмитриев') and (c == 'Новозыбкова')) or ((n == 'Ефимов') and (c == 'Жуковки')) and
        ((n == 'Ефимов') and (c == 'Жуковки')) or ((n == 'Иванов') and (c == 'Дятьков')))):
            print(n, file = f)
            print('Из', file = f)
            print(c,'\n', file = f)
f.close()
        
