f = open('output.txt','w')
pos =('Первый','Второй','Третий','Четвертый','Пятый','Шестой')
name =('Антон','Виктор','Григорий','Борис','Денис','Евгений')
for n in name:
    for p in pos:
        if((((n == 'Антон') and (p == 'Второй')) or ((n == 'Борис') and (p == 'Пятый')) and
          ((n == 'Виктор') and (p == 'Второй')) or ((n == 'Денис') and (p == 'Третий')) and
          ((n == 'Григорий') and (p == 'Первый')) or ((n == 'Борис') and (p == 'Третий')) and
          ((n == 'Антон') and (p == 'Третий')) or ((n == 'Евгений') and (p == 'Шестой')) and
          ((n == 'Виктор') and (p == 'Третий')) or ((n == 'Евгений') and (p == 'Четвертый')))):
              print(p, file = f)
              print('Был', file = f)
              print(n,'\n', file = f)
f.close()
